var arrayOfAdvices = ["Якщо Ви проявите ініціативу, успіх не змусить себе чекати.", 
"Ваші надії і плани збудуться понад всякі очікування.",
"Готуйтеся до романтичних пригод.",
"У цьому місяці нічне життя для вас.",
"Вам пора відпочити.",
"Вам пропонується мрія всього життя. Скажіть так!",
"Вас чекає приємний сюрприз.",
"Час - ваш союзник, краще відкласти прийняття важливого рішення хоча б на день.",
"Час і терпіння, вас чекають багато сюрпризів!",
"Час осушить всі сльози і зцілить всі рани.",
"Вітаємо! Ви знаходитесь на вірному шляху.",
"Підкоривши одну гору, починай штурмувати іншу...",
"Приплив енергії допоможе Вам впоратися з великим обсягом незапланованих робіт.",
"Прийміть те, що ви не можете змінити, і ви будете почувати себе краще.",
"Природа, час і терпіння - три великих лікаря.",
"Прийшов час діяти!",
"Прийшов час закінчити старе і почати нове.",
"Нехай світ наповниться спокоєм і доброзичливістю.",
"Робота з новими партнерами буде дуже вигідною.",
"Працюйте над дипломатичними здібностями - вони дуже знадобляться для реалізації ідей.",
"Міркуйте і не поспішайте з діями.",
"Дозвольте співчуттю направляти ваші рішення.",
"Результат Ваших дій може виявитися несподіваним.",
"Романтика перемістить вас в новому напрямку.",
"З цього моменту ваша доброта приведе вас до успіху.",
"Сьогодні у вас буде гарний день.",
"Сім разів відміряйте, один раз відріжте!",
"Слухайте кожного. Ідеї ​​приходять звідусіль.",
"Солов'я байками не годують.",
"Зосередьтеся на сім'ї і гармонії з навколишнім світом.",
"Щасливе життя прямо перед вами.",
"Тепер настав час спробувати щось нове.",
"Терпіння! Ви майже біля мети.",
"Той, хто знає, досить багатий.",
"Той, хто не чекає подяки, ніколи не буде розчарований.",
"Удача проводить Вас через всі важкі часи.",
"Приділіть особливу увагу старій дружбі.",
"Фізична активність значно поліпшить ваші погляди на життя сьогодні.",
"Гарний час, щоб закінчити старі починання.",
"Хороші новини прийдуть до вас поштою.",
"Добре зроблене краще, ніж добре сказане.",
"Хоч деякі і намагаються вам перешкодити, ви все одно досягнете поставленої мети.",
"Людина ніколи не стара, щоб вчитися. Нові знання принесуть Вам успіх.",
"Що не робиться - все на краще.",
"Це час, щоб рухатися. Ваш настрій покращиться.",
"Вам належить розглянути несподівану пропозицію.",
"Робіть те, чого просить душа і тіло.",
"Не залишайте зусиль і отримаєте бажане.",
"Хтось потребує вашої підтримки.",
"Візьми від життя Все!",
"Вчися знаходити в житті радість.",
"Багатий той, у кого на все є час.",
"Гарно подати себе - 80% успіху.",
"Якщо є готовність до конфлікту, привід завжди знайдеться.",
"Не встигнеш - зроблять інші.",
"Мастило одержує те колесо, яке найбільше скрипить.",
"Не питай і не відповідай. Істина - у мовчанні.",
"Вітаємо! Ви на правильному шляху.",
"Удача прийде до вас у руки вже в цьому місяці.",
"Приємний сюрприз чекає вас.",
"Задумане здійсниться.",
"Вір і хороше трапиться!",
"Зміни стануться в твоєму житті, пливи за течією.",
"Визначеність - це те, що тобі зараз потрібно...",
"Не дозволяй амбіціям затьмарити маленький успіх.",
"Мало думати, потрібно ще й робити!",
"Відпочинь! Тобі це зараз потрібно!",
"Тебе чекають хороші новини.",
"День буде прекрасний!",
"На помилках вчаться",
"Пора в дорогу! На тебе чекають пригоди!",
"Прислухайся до людей. Ідеї ​​можуть прийти ззовні.",
"Чекай допомоги від друзів",
"Вас чекають великі справи!",
"Ви приносите щастя!Ви талановиті!",
"Посміхайся! Хтось може закохатися в твою посмішку!"];

var backgroundColors = [];
var bgcolorsarrc =["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "a", "b", "c", "d" , "e", "f"];

var buttonGetAdvice = document.querySelector("button");
var advice = document.getElementsByTagName("p")[0];
var bodyColor = document.querySelector("body");
var pickedAdvice = pickAdvice();
var createdColor = "";
var generatedHexColor = randomSigns();




//picking random advice
function pickAdvice(){
	var randomAdvice = Math.floor(Math.random() * arrayOfAdvices.length);
	return arrayOfAdvices[randomAdvice];
}
// Event listener for GetAdvice Button
buttonGetAdvice.addEventListener("click", function(){
	advice.textContent = pickedAdvice;
	bodyColor.style.backgroundColor = generatedHexColor;
		if(pickedAdvice){
			this.textContent = "Another One?";
			pickedAdvice = pickAdvice();
			advice.textContent = pickedAdvice;
			generatedHexColor = randomSigns();
		}
});


/*var createdColor = "#";*/
// hex-color generating function
function randomSigns(){
createdColor = "#";
	for(var i = 0; i < 6; i++){
		var randomSignhex = Math.floor(Math.random() * bgcolorsarrc.length);
		var pickedRandomSign =  bgcolorsarrc[randomSignhex];
		createdColor += pickedRandomSign;
	}
	return createdColor;
}


